Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E20A.tmx
Source language: en_us
Languages: zh_cn

source: HOW TO DRESS LIKE KATE MIDDLETON: CASUAL WEAR (PART 1)
zh_cn: 如何像凯特 米德尔顿那样着装：非正式的着装（连载一）

source: Most of us fancy ourselves as more of a Bridget Jones than a Duchess of Cambridge.
zh_cn: 我们大多数人都幻想自己是圣布里奇特.琼斯而不是剑桥的公爵夫人。

source: If a helicopter causes our dress to billow, emblazoning our spanx for all to behold, do we laugh demurely and continue our royal business?
zh_cn: 如果一架直升飞机是我们的裙子飞起来，以防走光用纹章装饰我们的塑身裤，难道我们要假装笑一笑然后继续我们的正事吗？

source: No.
zh_cn: 不。

source: We retreat to the toilet, weeping, and consider departing the event by way of the staff exit.
zh_cn: 我们要躲到厕所，哭出来，然后想着从职员专用出口出来，摆脱这件糗事。

source: Alas, such social graces must be attained over time, and some of us may never reach their lofty heights.
zh_cn: 哎，要有社交的魅力，一些人也许永远不会达到他们满意的程度。

source: What is attainable, however, is Kate's infallible style.
zh_cn: 然而，凯特却能做到，凯特正确无误的穿衣风格。

source: Here's how.
zh_cn: 这儿有一些方法。

source: EVEN FOR A CASUAL LOOK, CLOTHES MUST BE WELL FITTING.
zh_cn: 1）即使很随意，穿着必须得体。

source: But there is a line between well fitting, and that which resembles spray-on denim. The red jeans Kate wore to play hockey with the Great Britain team in 2012 are an excellent example - flattering, not too long, and suitable for the occasion.
zh_cn: 但是在穿着得体和类似喷式劳动布之间有个标准，在2012年穿红色牛仔的凯特与英国队队员打曲棍球，这就是一个很好的例子——使她显得更漂亮了，这件红色牛仔不是很长，而且很适合这个场合。

source: Steer clear of ultra, ultra skinny jeans or leggings - a cigarette, slim, or straight leg style is preferable (available from 20 pounds on ASOS).
zh_cn: 绝对的焦点，紧身牛仔或者裹腿——像一根雪茄，苗条，笔直的腿真是美极了。

source: Think Sandy at the beginning of Grease, rather than the end.
zh_cn: 想想刚开始的Sandy而不是结束。

source: A TAILORED BLAZER IS YOUR KEY TO THE ¡®SMART-CASUAL' DRESS CODE.
zh_cn: 2）一件定做的颜色鲜艳的运动上衣是休闲随意的关键。

source: This need not necessitate a pricey trip to Jermyn Street in London.
zh_cn: 在伦敦Jermyn街价格昂贵的旅行是没必要的。

source: A favourite of Kate's is a navy double-breasted number from Zara, which accentuates the waist and dignifies a bland jeans and shirt combination.
zh_cn: 凯特最喜欢的是来自扎拉的一支海军，这支海军胸襟宽广，他们强调腰部而且以平淡无奇的牛仔装和衬衫而著称。

source: All yours for about 60 pounds.
zh_cn: 所有的这些大概只需要60英镑。

source: Not bad for a solid sartorial investment.
zh_cn: 有益于裁缝的投资。

source: DON'T UNDERESTIMATE THE VALUE OF A BELT.
zh_cn: 3）不要低估一条腰带的价值。

source: They enhance any silhouette and make even the most boring of jackets regal.
zh_cn: 它们会使你的轮廓更加明显 而且是平淡无奇的夹克衫变的光彩熠熠。

source: Kate's jewel green Catherine Walker coat would have been something of a lesser creation without one.
zh_cn: 凯特的那件镶有宝石的绿色Catherine Walker风衣在某种意义上来说是少有的杰作。

source: ONE'S MIDRIFF IS NEVER BARED.
zh_cn: 4）一个人的肚子是绝对不能露出来的。

source: Apart from perhaps in a bikini.
zh_cn: 也许除了穿比基尼的时候。

source: This is, of course, also true of formalwear.
zh_cn: 当然了，这也是正装。

source: NOTHING TOO LOW-CUT.
zh_cn: 5）不要低胸的。

source: Kate is not a bastion of Puritanical fashion, so a bit of flesh is, on occasion permissible (cf Kate at the Olympics in 2012).
zh_cn: 凯特不是清教徒式的捍卫者，因此有时在可以的情况下露一点（凯特在2012年奥运会上）。

source: On the whole, however, Catherine opts for a collar, or higher neckline.
zh_cn: 然而，整体上来说，凯瑟琳一般选的是有衣领的或者是搞领口的衣服。

source: Be guided by the coveted Zimmermann dress she wore during her New Zealand and Australia tour.
zh_cn: 在她的新西兰和澳大利亚之行期间，她穿的都是让人梦寐以求的Zimmermann这个名牌的衣服。

source: NOTHING TOO SHORT.
zh_cn: 6)不要太短的。

source: Again, note the Zimmermann dress.
zh_cn: 再次，注意Zimmermann这个牌子的衣服。

source: Unless you are planning to stand perfectly still for the duration of the day, a mini skirt is simply not tenable.
zh_cn: 除非你在这连续几天里正计划着完全地抵抗它，一件迷你裙就说不过去了。

source: One cannot stoop to greet children or fulfil one's role as a patron of a sport's charity to the necessary degree if a flash of bottom is a genuine threat.
zh_cn: 如果一瞬间屁股的曝光是真正的威胁，那么一个人不可能弯腰去问候孩子们或者作为一个体育慈善团体的赞助人。

source: High street stockists such as L. K. Bennett, Hobbs, Whistles and Reiss are perfect for this type of thing - clearly, as Kate has worn a number of their elegant creations in the past.
zh_cn: High街道上的批发商最擅长这类事情了，比如：L. K. Bennett, Hobbs，Whistles和Reiss——当然了，凯特以前穿过很多他们的具有气质的衣服。

source: KEEP HAIR AND MAKEUP SIMPLE.
zh_cn: 7）保持发型利落和淡妆。

source: Loose waves are effortlessly chic and even look good at the end of the day when they've lost their lustre and are easily achieved with the aid of straighteners or curling tongs.
zh_cn: 当他们失去光泽、直发或者卷发很容易如愿以偿的时候，松散波浪形的发型毫不疑问是很时髦，甚至在一天结束的时候看起来也相当不错。

source: Updos extend to a simple ponytail or half up/half down arrangement.
zh_cn: 梳高髻到简单的马尾辫或者公主头。

source: Skin is flawless, but not smothered in highlighter or blusher.
zh_cn: 皮肤是很完美的，而不是用荧光笔或红色敷面粉遮住的。

source: A sweep of eyeliner is permissible, but save eye shadow for eveningwear.
zh_cn: 眼线是允许画的，为了晚礼服要遮住眼袋。

source: Less is more: one wants to look like a queen of the sovereign, rather than drag, variety.
zh_cn: 或多或少：一个人要想看起来像至高无上的女王，而不是垃圾。

source: IF YOU'RE GOING TO WEAR HEELS, OPT FOR SOMETHING COMFORTABLE.
zh_cn: 8）如果你打算穿高跟鞋，选择穿着舒服的。

source: There is no pain quite like that induced by uncomfortable shoes.
zh_cn: 由穿着不舒服的鞋引发的疼痛。

source: Wedges put less pressure on the balls of your feet than stilettos so are much better if you will be standing for long periods of time (Kate has a lovely tan pair from Russell and Bromley).
zh_cn: 假如你将站很长一段时间，把楔形物放在你脚的大脚趾球上并施于很小的压力比细高跟鞋的压力还小（凯特有一双由拉塞尔和布罗姆利设计的很漂亮的很褐色的鞋）。

source: Agonised hobbling from foot to foot is not becoming of a young lady.
zh_cn: 一位年轻的女士不应该痛苦的一步步的跛着走。

source: If heels aren't your cup of tea try some stylish brogues - something along the lines of Victoria Beckham's stylish YSL monochrome pair would be a fitting alternative.
zh_cn: 如果高跟鞋不适合你，试试其他时髦的粗革皮鞋——沿着维多利亚贝克汉姆的时髦 线走也是不错的选择。

source: SAVE THE BLING FOR FORMALWEAR.
zh_cn: 9）正装不需要过多的珠宝装饰。

source: You don't want to be laden with the crown's jewels and then be called upon to hold a urinating koala bear, or participate in an inaugural match of netball.
zh_cn: 你不想负载镶有珠宝的王冠然后被要求抱着无尾熊，或者参加一场类似篮球球赛的开幕。

source: They will only get in your way.
zh_cn: 他们就会祝你一臂之力。

source: Simple stud earrings are ideal daywear, but reserve your best embellishment for formalwear.
zh_cn: 简单的饰钮耳环是白天必带的理想之物，但是为你的正装保留最好的装饰。
